#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.backend_dev.module.users.module.api_log_group.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=videoStreamer-dev]
module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=nzgsamru6h]
module.backend_dev.module.users.aws_cognito_user_pool.user_pool: Refreshing state... [id=us-east-2_v7DeZumRG]
module.frontend.aws_wafv2_web_acl.waf_acl: Refreshing state... [id=4e60e6b0-61a3-4a70-9a60-4a252f3e7c7c]
module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.backend_dev.module.users.aws_ssm_parameter.users_pool_id: Refreshing state... [id=/videoStreamer/dev/pool_id]
module.backend_dev.module.users.aws_cognito_user_pool_client.client: Refreshing state... [id=287eqldkvgeud87b90lgjvl95u]
module.backend_dev.module.users.aws_ssm_parameter.users_client_id: Refreshing state... [id=/videoStreamer/dev/client_id]
module.backend_dev.module.users.aws_ssm_parameter.users_client_secret: Refreshing state... [id=/videoStreamer/dev/client_secret]
module.backend_dev.module.users.null_resource.build: Refreshing state... [id=5996675141142987770]
module.backend_dev.module.users.module.lambdas["register"].aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/auth_register]
module.backend_dev.module.users.module.lambdas["confirm_register"].aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/auth_confirm_register]
module.backend_dev.module.users.module.lambdas["confirm_register"].local_file.archive_plan[0]: Refreshing state... [id=4fb0e3889c9867d3c4f095236e1bdc9351b569e8]
module.backend_dev.module.users.module.lambdas["register"].local_file.archive_plan[0]: Refreshing state... [id=487ef0a66fd2f36b3c566e32084a002b56141b91]
module.backend_dev.module.users.module.lambdas["register"].aws_iam_role.lambda[0]: Refreshing state... [id=auth_register]
module.backend_dev.module.users.module.lambdas["confirm_register"].aws_iam_role.lambda[0]: Refreshing state... [id=auth_confirm_register]
module.backend_dev.module.users.module.lambdas["register"].null_resource.archive[0]: Refreshing state... [id=2924826125139019736]
module.backend_dev.module.users.module.lambdas["confirm_register"].null_resource.archive[0]: Refreshing state... [id=4732047861588676661]
module.backend_dev.module.users.module.lambdas["confirm_register"].aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::529080338478:policy/auth_confirm_register-logs]
module.backend_dev.module.users.module.lambdas["register"].aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::529080338478:policy/auth_register-logs]
module.frontend.aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E2KG39NGUA7DI2]
module.frontend.aws_acm_certificate.ssl: Refreshing state... [id=arn:aws:acm:us-east-1:529080338478:certificate/3f355d4e-762e-4305-a1de-b04e42a54abd]
module.frontend.aws_s3_bucket.bucket: Refreshing state... [id=video.rayprogramming.com]
module.backend_dev.module.users.module.lambdas["register"].aws_lambda_function.this[0]: Refreshing state... [id=auth_register]
module.backend_dev.module.users.module.lambdas["confirm_register"].aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=auth_confirm_register-20220425021822920900000003]
module.backend_dev.module.users.module.lambdas["register"].aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=auth_register-20220425021822884300000002]
module.backend_dev.module.users.module.lambdas["confirm_register"].aws_lambda_function.this[0]: Refreshing state... [id=auth_confirm_register]
module.frontend.aws_route53_record.ssl_verification["video.rayprogramming.com"]: Refreshing state... [id=Z0504674431EVA0LRLBF__03818f016c5687757483524eb672ebaa.video.rayprogramming.com._CNAME]
module.frontend.aws_route53_record.ssl_verification["www.video.rayprogramming.com"]: Refreshing state... [id=Z0504674431EVA0LRLBF__cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com._CNAME]
module.frontend.aws_acm_certificate_validation.ssl: Refreshing state... [id=2022-01-23 21:54:35.297 +0000 UTC]
module.backend_dev.module.users.module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-2:529080338478:certificate/2f221873-dbad-4d61-a07c-be555775cb6c]
module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_integration.this["POST /register"]: Refreshing state... [id=02uz67o]
module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_integration.this["POST /confirm"]: Refreshing state... [id=kdyrcer]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2QZVOHCSCH69J]
module.frontend.aws_s3_bucket_acl.bucket_acl: Refreshing state... [id=video.rayprogramming.com,private]
module.frontend.aws_s3_bucket_public_access_block.bucket_pab: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_s3_bucket_versioning.bucket_version: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=video.rayprogramming.com]
module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_route.this["POST /confirm"]: Refreshing state... [id=x4vlsbt]
module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_route.this["POST /register"]: Refreshing state... [id=bly4pgm]
module.frontend.aws_route53_record.subdomain_root: Refreshing state... [id=Z0504674431EVA0LRLBF_video.rayprogramming.com_A]
module.frontend.aws_route53_record.subdomain_www: Refreshing state... [id=Z0504674431EVA0LRLBF_www.video.rayprogramming.com_A]
module.backend_dev.module.users.module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z0504674431EVA0LRLBF__d15789f6dfdbf2a94e5e29ee974e9637.auth.video.rayprogramming.com._CNAME]
module.backend_dev.module.users.module.acm.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2022-04-25 02:18:29.181 +0000 UTC]
module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=auth.video.rayprogramming.com]
module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=dtaymf]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_integration.this["POST /confirm"] has changed
  ~ resource "aws_apigatewayv2_integration" "this" {
        id                     = "kdyrcer"
      + request_parameters     = {}
      + request_templates      = {}
        # (7 unchanged attributes hidden)
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_integration.this["POST /register"] has changed
  ~ resource "aws_apigatewayv2_integration" "this" {
        id                     = "02uz67o"
      + request_parameters     = {}
      + request_templates      = {}
        # (7 unchanged attributes hidden)
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_route.this["POST /confirm"] has changed
  ~ resource "aws_apigatewayv2_route" "this" {
      + authorization_scopes = []
        id                   = "x4vlsbt"
      + request_models       = {}
        # (5 unchanged attributes hidden)
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_route.this["POST /register"] has changed
  ~ resource "aws_apigatewayv2_route" "this" {
      + authorization_scopes = []
        id                   = "bly4pgm"
      + request_models       = {}
        # (5 unchanged attributes hidden)
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_stage.default[0] has changed
  ~ resource "aws_apigatewayv2_stage" "default" {
      + deployment_id   = "i8b5mb"
        id              = "$default"
        name            = "$default"
        tags            = {
            "Name" = "videoStreamer-dev"
        }
        # (7 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.backend_dev.module.users.module.lambdas["confirm_register"].aws_lambda_function.this[0] has changed
  # (moved from module.backend_dev.module.users.module.confirm_register_lambda.aws_lambda_function.this[0])
  ~ resource "aws_lambda_function" "this" {
        id                             = "auth_confirm_register"
      + layers                         = []
        tags                           = {
            "Name" = "videoStreamer-dev"
        }
        # (25 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.backend_dev.module.users.module.lambdas["confirm_register"].local_file.archive_plan[0] has been deleted
  # (moved from module.backend_dev.module.users.module.confirm_register_lambda.local_file.archive_plan[0])
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - ".terraform/modules/backend_dev.users/functions/dist/confirmRegistration.js",
                      - null,
                    ],
                ]
              - filename      = "builds/89c9d353cb47b7786e931df1fb6fbc58114408faa7c62ac035cbdb54c17eea9c.zip"
              - runtime       = "nodejs14.x"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/89c9d353cb47b7786e931df1fb6fbc58114408faa7c62ac035cbdb54c17eea9c.plan.json" -> null
      - id                   = "4fb0e3889c9867d3c4f095236e1bdc9351b569e8" -> null
    }

  # module.backend_dev.module.users.module.lambdas["register"].aws_lambda_function.this[0] has changed
  # (moved from module.backend_dev.module.users.module.register_lambda.aws_lambda_function.this[0])
  ~ resource "aws_lambda_function" "this" {
        id                             = "auth_register"
      + layers                         = []
        tags                           = {
            "Name" = "videoStreamer-dev"
        }
        # (25 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.backend_dev.module.users.module.lambdas["register"].local_file.archive_plan[0] has been deleted
  # (moved from module.backend_dev.module.users.module.register_lambda.local_file.archive_plan[0])
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - ".terraform/modules/backend_dev.users/functions/dist/register.js",
                      - null,
                    ],
                ]
              - filename      = "builds/cfcc866a18583bb93cc4a7d1304f6407b555be681ca5ccabc933394ae63ae59b.zip"
              - runtime       = "nodejs14.x"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/cfcc866a18583bb93cc4a7d1304f6407b555be681ca5ccabc933394ae63ae59b.plan.json" -> null
      - id                   = "487ef0a66fd2f36b3c566e32084a002b56141b91" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.backend_dev.module.users.null_resource.build must be replaced
+/- resource "null_resource" "build" {
      ~ id       = "5996675141142987770" -> (known after apply)
      ~ triggers = { # forces replacement
          - "always_run" = "2022-04-25T02:21:05Z" -> null
          + "file_ids"   = "0e32cbbe1fc85492e99378f3f919716795033480c4df2d851b1bbe0897cbcea5, c7f2d277a05185431f68d5565849f5d5b6fcf0ea5a2c9f83d8314206329fc52b, 9a24ea5bb09fe81c0c27c93b74d975e52a5dc74fcd40ed4c6e317cffacac43bc"
        }
    }

  # module.backend_dev.module.users.module.lambdas["confirm_register"].data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
  # (moved from module.backend_dev.module.users.module.confirm_register_lambda.data.aws_iam_policy_document.assume_role[0])
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.backend_dev.module.users.module.lambdas["confirm_register"].data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
  # (moved from module.backend_dev.module.users.module.confirm_register_lambda.data.aws_iam_policy_document.logs[0])
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "2777561895" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.backend_dev.module.users.module.lambdas["confirm_register"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
  # (moved from module.backend_dev.module.users.module.confirm_register_lambda.data.aws_partition.current)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.backend_dev.module.users.module.lambdas["confirm_register"].data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
  # (moved from module.backend_dev.module.users.module.confirm_register_lambda.data.external.archive_prepare[0])
 <= data "external" "archive_prepare"  {
      ~ id      = "-" -> (known after apply)
      ~ program = [
            "python3",
          - ".terraform/modules/backend_dev.users.confirm_register_lambda/package.py",
          + ".terraform/modules/backend_dev.users.lambdas/package.py",
            "prepare",
        ]
      ~ query   = {
          + "docker"                   = null
          ~ "paths"                    = jsonencode(
              ~ {
                  ~ cwd    = "/home/james/Code/github/rihoj/videoStreamer/infrastructure" -> "/home/runner/work/videoStreamer/videoStreamer/infrastructure"
                  ~ module = ".terraform/modules/backend_dev.users.confirm_register_lambda" -> ".terraform/modules/backend_dev.users.lambdas"
                    # (1 unchanged element hidden)
                }
            )
            # (6 unchanged elements hidden)
        }
      ~ result  = {
          - "build_plan"          = jsonencode(
                {
                  - artifacts_dir = "builds"
                  - build_plan    = [
                      - [
                          - "zip",
                          - ".terraform/modules/backend_dev.users/functions/dist/confirmRegistration.js",
                          - null,
                        ],
                    ]
                  - filename      = "builds/89c9d353cb47b7786e931df1fb6fbc58114408faa7c62ac035cbdb54c17eea9c.zip"
                  - runtime       = "nodejs14.x"
                }
            )
          - "build_plan_filename" = "builds/89c9d353cb47b7786e931df1fb6fbc58114408faa7c62ac035cbdb54c17eea9c.plan.json"
          - "filename"            = "builds/89c9d353cb47b7786e931df1fb6fbc58114408faa7c62ac035cbdb54c17eea9c.zip"
          - "timestamp"           = "1650824508913860000"
          - "was_missing"         = "false"
        } -> (known after apply)
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.aws_cloudwatch_log_group.lambda[0] has moved to module.backend_dev.module.users.module.lambdas["confirm_register"].aws_cloudwatch_log_group.lambda[0]
    resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/auth_confirm_register"
        name              = "/aws/lambda/auth_confirm_register"
        tags              = {
            "Name" = "videoStreamer-dev"
        }
        # (3 unchanged attributes hidden)
    }

  # module.backend_dev.module.users.module.lambdas["confirm_register"].aws_iam_policy.logs[0] will be updated in-place
  # (moved from module.backend_dev.module.users.module.confirm_register_lambda.aws_iam_policy.logs[0])
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::529080338478:policy/auth_confirm_register-logs"
        name      = "auth_confirm_register-logs"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Name" = "videoStreamer-dev"
        }
        # (4 unchanged attributes hidden)
    }

  # module.backend_dev.module.users.module.lambdas["confirm_register"].aws_iam_role.lambda[0] will be updated in-place
  # (moved from module.backend_dev.module.users.module.confirm_register_lambda.aws_iam_role.lambda[0])
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "auth_confirm_register"
        name                  = "auth_confirm_register"
        tags                  = {
            "Name" = "videoStreamer-dev"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.aws_iam_role_policy_attachment.logs[0] has moved to module.backend_dev.module.users.module.lambdas["confirm_register"].aws_iam_role_policy_attachment.logs[0]
    resource "aws_iam_role_policy_attachment" "logs" {
        id         = "auth_confirm_register-20220425021822920900000003"
        # (2 unchanged attributes hidden)
    }

  # module.backend_dev.module.users.module.lambdas["confirm_register"].aws_lambda_function.this[0] will be updated in-place
  # (moved from module.backend_dev.module.users.module.confirm_register_lambda.aws_lambda_function.this[0])
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/89c9d353cb47b7786e931df1fb6fbc58114408faa7c62ac035cbdb54c17eea9c.zip" -> (known after apply)
        id                             = "auth_confirm_register"
      ~ last_modified                  = "2022-04-25T02:21:18.771+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:529080338478:function:auth_confirm_register:3" -> (known after apply)
      ~ source_code_hash               = "HD04ExlQsfhNl4Tzp+3kCIHKawJCxXiXmelUuqi9mzM=" -> (known after apply)
        tags                           = {
            "Name" = "videoStreamer-dev"
        }
      ~ version                        = "3" -> (known after apply)
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.backend_dev.module.users.module.lambdas["confirm_register"].local_file.archive_plan[0] will be created
  # (moved from module.backend_dev.module.users.module.confirm_register_lambda.local_file.archive_plan[0])
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.backend_dev.module.users.module.lambdas["confirm_register"].null_resource.archive[0] must be replaced
  # (moved from module.backend_dev.module.users.module.confirm_register_lambda.null_resource.archive[0])
+/- resource "null_resource" "archive" {
      ~ id       = "4732047861588676661" -> (known after apply)
      ~ triggers = {
          - "filename"  = "builds/89c9d353cb47b7786e931df1fb6fbc58114408faa7c62ac035cbdb54c17eea9c.zip"
          - "timestamp" = "1650824508913860000"
        } -> (known after apply) # forces replacement
    }

  # module.backend_dev.module.users.module.lambdas["login"].data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.backend_dev.module.users.module.lambdas["login"].data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.backend_dev.module.users.module.lambdas["login"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.backend_dev.module.users.module.lambdas["login"].data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      + id      = (known after apply)
      + program = [
          + "python3",
          + ".terraform/modules/backend_dev.users.lambdas/package.py",
          + "prepare",
        ]
      + query   = {
          + "artifacts_dir"            = "builds"
          + "docker"                   = null
          + "hash_extra"               = ""
          + "hash_extra_paths"         = jsonencode([])
          + "paths"                    = jsonencode(
                {
                  + cwd    = "/home/runner/work/videoStreamer/videoStreamer/infrastructure"
                  + module = ".terraform/modules/backend_dev.users.lambdas"
                  + root   = "."
                }
            )
          + "recreate_missing_package" = "true"
          + "runtime"                  = "nodejs14.x"
          + "source_path"              = "\".terraform/modules/backend_dev.users/functions/dist/login.js\""
        }
      + result  = (known after apply)
    }

  # module.backend_dev.module.users.module.lambdas["login"].aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/auth_login"
      + retention_in_days = 0
      + tags              = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all          = {
          + "Name" = "videoStreamer-dev"
        }
    }

  # module.backend_dev.module.users.module.lambdas["login"].aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "auth_login-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all  = {
          + "Name" = "videoStreamer-dev"
        }
    }

  # module.backend_dev.module.users.module.lambdas["login"].aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "auth_login"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all              = {
          + "Name" = "videoStreamer-dev"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.backend_dev.module.users.module.lambdas["login"].aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "auth_login"
    }

  # module.backend_dev.module.users.module.lambdas["login"].aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Login function"
      + filename                       = (known after apply)
      + function_name                  = "auth_login"
      + handler                        = "login.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all                       = {
          + "Name" = "videoStreamer-dev"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CLIENT_ID"     = "287eqldkvgeud87b90lgjvl95u"
              + "CLIENT_SECRET" = (sensitive)
              + "POOL_ID"       = "us-east-2_v7DeZumRG"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.backend_dev.module.users.module.lambdas["login"].local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.backend_dev.module.users.module.lambdas["login"].null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.backend_dev.module.users.module.lambdas["register"].data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
  # (moved from module.backend_dev.module.users.module.register_lambda.data.aws_iam_policy_document.assume_role[0])
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.backend_dev.module.users.module.lambdas["register"].data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
  # (moved from module.backend_dev.module.users.module.register_lambda.data.aws_iam_policy_document.logs[0])
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "4227650822" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.backend_dev.module.users.module.lambdas["register"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
  # (moved from module.backend_dev.module.users.module.register_lambda.data.aws_partition.current)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.backend_dev.module.users.module.lambdas["register"].data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
  # (moved from module.backend_dev.module.users.module.register_lambda.data.external.archive_prepare[0])
 <= data "external" "archive_prepare"  {
      ~ id      = "-" -> (known after apply)
      ~ program = [
            "python3",
          - ".terraform/modules/backend_dev.users.register_lambda/package.py",
          + ".terraform/modules/backend_dev.users.lambdas/package.py",
            "prepare",
        ]
      ~ query   = {
          + "docker"                   = null
          ~ "paths"                    = jsonencode(
              ~ {
                  ~ cwd    = "/home/james/Code/github/rihoj/videoStreamer/infrastructure" -> "/home/runner/work/videoStreamer/videoStreamer/infrastructure"
                  ~ module = ".terraform/modules/backend_dev.users.register_lambda" -> ".terraform/modules/backend_dev.users.lambdas"
                    # (1 unchanged element hidden)
                }
            )
            # (6 unchanged elements hidden)
        }
      ~ result  = {
          - "build_plan"          = jsonencode(
                {
                  - artifacts_dir = "builds"
                  - build_plan    = [
                      - [
                          - "zip",
                          - ".terraform/modules/backend_dev.users/functions/dist/register.js",
                          - null,
                        ],
                    ]
                  - filename      = "builds/cfcc866a18583bb93cc4a7d1304f6407b555be681ca5ccabc933394ae63ae59b.zip"
                  - runtime       = "nodejs14.x"
                }
            )
          - "build_plan_filename" = "builds/cfcc866a18583bb93cc4a7d1304f6407b555be681ca5ccabc933394ae63ae59b.plan.json"
          - "filename"            = "builds/cfcc866a18583bb93cc4a7d1304f6407b555be681ca5ccabc933394ae63ae59b.zip"
          - "timestamp"           = "1650824508916195000"
          - "was_missing"         = "false"
        } -> (known after apply)
    }

  # module.backend_dev.module.users.module.register_lambda.aws_cloudwatch_log_group.lambda[0] has moved to module.backend_dev.module.users.module.lambdas["register"].aws_cloudwatch_log_group.lambda[0]
    resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/auth_register"
        name              = "/aws/lambda/auth_register"
        tags              = {
            "Name" = "videoStreamer-dev"
        }
        # (3 unchanged attributes hidden)
    }

  # module.backend_dev.module.users.module.lambdas["register"].aws_iam_policy.logs[0] will be updated in-place
  # (moved from module.backend_dev.module.users.module.register_lambda.aws_iam_policy.logs[0])
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::529080338478:policy/auth_register-logs"
        name      = "auth_register-logs"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Name" = "videoStreamer-dev"
        }
        # (4 unchanged attributes hidden)
    }

  # module.backend_dev.module.users.module.lambdas["register"].aws_iam_role.lambda[0] will be updated in-place
  # (moved from module.backend_dev.module.users.module.register_lambda.aws_iam_role.lambda[0])
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "auth_register"
        name                  = "auth_register"
        tags                  = {
            "Name" = "videoStreamer-dev"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.backend_dev.module.users.module.register_lambda.aws_iam_role_policy_attachment.logs[0] has moved to module.backend_dev.module.users.module.lambdas["register"].aws_iam_role_policy_attachment.logs[0]
    resource "aws_iam_role_policy_attachment" "logs" {
        id         = "auth_register-20220425021822884300000002"
        # (2 unchanged attributes hidden)
    }

  # module.backend_dev.module.users.module.lambdas["register"].aws_lambda_function.this[0] will be updated in-place
  # (moved from module.backend_dev.module.users.module.register_lambda.aws_lambda_function.this[0])
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/cfcc866a18583bb93cc4a7d1304f6407b555be681ca5ccabc933394ae63ae59b.zip" -> (known after apply)
        id                             = "auth_register"
      ~ last_modified                  = "2022-04-25T02:21:25.450+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:529080338478:function:auth_register:3" -> (known after apply)
      ~ source_code_hash               = "Z8Agp8nypTc+1hfj/gs09hyyT1ThlDqg0johh5EVnfw=" -> (known after apply)
        tags                           = {
            "Name" = "videoStreamer-dev"
        }
      ~ version                        = "3" -> (known after apply)
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.backend_dev.module.users.module.lambdas["register"].local_file.archive_plan[0] will be created
  # (moved from module.backend_dev.module.users.module.register_lambda.local_file.archive_plan[0])
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.backend_dev.module.users.module.lambdas["register"].null_resource.archive[0] must be replaced
  # (moved from module.backend_dev.module.users.module.register_lambda.null_resource.archive[0])
+/- resource "null_resource" "archive" {
      ~ id       = "2924826125139019736" -> (known after apply)
      ~ triggers = {
          - "filename"  = "builds/cfcc866a18583bb93cc4a7d1304f6407b555be681ca5ccabc933394ae63ae59b.zip"
          - "timestamp" = "1650824508916195000"
        } -> (known after apply) # forces replacement
    }

Plan: 12 to add, 6 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Rihoj, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*